package operator;

public class Demo06 {
    public static void main(String[] args) {
        /*
        面试题
        2*8 = 16 怎们算最快

        0000 0000  0
        0000 0001  1
        0000 0010  2
        0000 0011  3
        0000 0100  4
        0000 0101  5
        0000 1000  8
        0001 0000  16

        左移 <<  *  2
        右移 >>  /  2
        效率高！！！！！！
        */
        System.out.println(2<<3);
        /*

                A = 0011 1100
                b = 0000 1101

        A&B  = 0000 1100  对应位数相比较 如果都为1则返回1，否则为0
        A|B  = 0011 1101  对应位数相比较 如果都为0返回0，否则为1
        A^B  = 0011 0001  对应位数相比较 如果两位相同返回0，否则返回1
        ~B   = 1111 0010   完全取反
         */
    }
}
